---
kind: type
id: T:Autodesk.Revit.DB.Analysis.SystemsAnalysisOptions
source: html/8d8fe6a8-d3f6-c4fd-99ac-3181ba0253d6.htm
---
# Autodesk.Revit.DB.Analysis.SystemsAnalysisOptions

Contains the options for systems analysis.

## Syntax (C#)
```csharp
public class SystemsAnalysisOptions : IDisposable
```